{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_5", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 42], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_14"}, "name": "input_14", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_21", "trainable": true, "dtype": "float32", "num_heads": 3, "key_dim": 42, "value_dim": 42, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 1, 42], "key_shape": [null, 1, 42], "value_shape": [null, 1, 42]}, "name": "multi_head_attention_21", "inbound_nodes": [[["input_14", 0, 0, {"value": ["input_14", 0, 0]}]]]}, {"class_name": "Dense", "config": {"name": "dense_185", "trainable": true, "dtype": "float32", "units": 42, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_185", "inbound_nodes": [[["multi_head_attention_21", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_113", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_113", "inbound_nodes": [[["dense_185", 0, 0, {"training": true}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_12", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_12", "inbound_nodes": [["input_14", 0, 0, {"y": ["dropout_113", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_76", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_76", "inbound_nodes": [[["tf.__operators__.add_12", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_13", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_13", "inbound_nodes": [["layer_normalization_76", 0, 0, {"y": ["dropout_113", 0, 0], "name": null}]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_77", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_77", "inbound_nodes": [[["tf.__operators__.add_13", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_38", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling1d_38", "inbound_nodes": [[["layer_normalization_77", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_188", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_188", "inbound_nodes": [[["global_average_pooling1d_38", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_115", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_115", "inbound_nodes": [[["dense_188", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_189", "trainable": true, "dtype": "float32", "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_189", "inbound_nodes": [[["dropout_115", 0, 0, {}]]]}], "input_layers": [["input_14", 0, 0]], "output_layers": [["dense_189", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_185/kernel", "shape": [42, 42], "dtype": "float32"}, {"name": "dense_185/bias", "shape": [42], "dtype": "float32"}, {"name": "dense_188/kernel", "shape": [42, 64], "dtype": "float32"}, {"name": "dense_188/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_189/kernel", "shape": [64, 11], "dtype": "float32"}, {"name": "dense_189/bias", "shape": [11], "dtype": "float32"}, {"name": "layer_normalization_76/gamma", "shape": [42], "dtype": "float32"}, {"name": "layer_normalization_76/beta", "shape": [42], "dtype": "float32"}, {"name": "layer_normalization_77/gamma", "shape": [42], "dtype": "float32"}, {"name": "layer_normalization_77/beta", "shape": [42], "dtype": "float32"}, {"name": "multi_head_attention_21/query/kernel", "shape": [42, 3, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/query/bias", "shape": [3, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/key/kernel", "shape": [42, 3, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/key/bias", "shape": [3, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/value/kernel", "shape": [42, 3, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/value/bias", "shape": [3, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/attention_output/kernel", "shape": [3, 42, 42], "dtype": "float32"}, {"name": "multi_head_attention_21/attention_output/bias", "shape": [42], "dtype": "float32"}]}]}